In [1]:
import pandas as pd
#to read a cvs file using a pandas
df = pd.read_csv("Titanic_data.csv")
df

,PassengerId,Survived,Name,Sex,Age,Siblings - Spouse,Parents - Children,Ticket,Ticket class,Fare,Cabin,Port of embarkation
0,1,0.0,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,3,7.2500,NaN,S
1,2,1.0,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,1,71.2833,C85,C
2,3,1.0,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,3,7.9250,NaN,S
3,4,1.0,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,1,53.1000,C123,S
4,5,0.0,"Allen, Mr. William Henry",male,35.0,0,0,373450,3,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
1304,1305,NaN,"Spector, Mr. Woolf",male,NaN,0,0,A.5. 3236,3,8.0500,NaN,S
1305,1306,NaN,"Oliva y Ocana, Dona. Fermina",female,39.0,0,0,PC 17758,1,108.9000,C105,C
1306,1307,NaN,"Saether, Mr. Simon Sivertsen",male,38.5,0,0,SOTON/O.Q. 3101262,3,7.2500,NaN,S
1307,1308,NaN,"Ware, Mr. Frederick",male,NaN,0,0,359309,3,8.0500,NaN,S
1308,1309,NaN,"Peter, Master. Michael J",male,NaN,1,1,2668,3,22.3583,NaN,C

In [2]:
# Question 1 : How many people are in titanic and how many survivors?

len(df[df["PassengerId"]!=0]) #we have int total 1309 passangers

1309

In [3]:
len(df[df["Survived"]==1]) #we have in total 342 survivors

342

In [4]:
# Question 2 : How many that survived were female and how many that died were female?
len(df[df["Sex"]=="female"]) #we have in total 466 females

466

In [5]:
len(df[(df["Sex"]=="female") & (df["Survived"]==1)]) #233 females survived, so 233 females died

233

In [6]:
# Question 3 : How many children were on the titanic?
len(df[df["Age"]<17]) #134

134

In [7]:
# Question 4 : How many children died that were on the ship?
len(df[(df["Age"]<17) & (df["Survived"]==0)]) #45

45

In [8]:
# Question 5 : How many people had families with them?
len(df[(df["Siblings - Spouse"]!=0) | (df["Parents - Children"]!=0)]) #519 "|" is "or"

519

In [9]:
# Question 6 : What is the ratio of female to male?
len(df[df["Sex"]=="male"]) 

print(len(df[df["Sex"]=="female"])/len(df[df["Sex"]=="male"])) #ratio is 0,5528

0.5527876631079478

In [10]:
# Question 7 : What contributed to the survival of those who survived?

#I want to find correlation between survival variable and the rest of df,
#but some data are categorical and needs to be transformed into number

def f(row):
    if row['Sex'] == "female":
        val = 1
    else:
        val = 0
    return val

In [19]:
correlation = df 
correlation = correlation.drop(['PassengerId',"Name","Ticket", "Fare","Cabin"], axis = 1) 
print(dfcorr)

      Survived     Sex   Age  Siblings - Spouse  Parents - Children  \
0          0.0    male  22.0                  1                   0
1          1.0  female  38.0                  1                   0
2          1.0  female  26.0                  0                   0
3          1.0  female  35.0                  1                   0
4          0.0    male  35.0                  0                   0
...        ...     ...   ...                ...                 ...
1304       NaN    male   NaN                  0                   0
1305       NaN  female  39.0                  0                   0
1306       NaN    male  38.5                  0                   0
1307       NaN    male   NaN                  0                   0
1308       NaN    male   NaN                  1                   1

      Ticket class Port of embarkation
0                3                   S
1                1                   C
2                3                   S
3                1                   S
4                3                   S
...            ...                 ...
1304             3                   S
1305             1                   C
1306             3                   S
1307             3                   S
1308             3                   C

[1309 rows x 7 columns]

In [20]:
#until here, is fine but I still need to change "one to many" the "Port of embarkation"
#first I change to shorter name
correlation = correlation.rename(columns={"Port of embarkation": "PortofEmb"})

In [21]:
#define one to many function
def g(row):
    if row["PortofEmb"] == "S":
        va = 1
    elif row["PortofEmb"] == "Q":
        va = -1
    else:
        va = 0 ##"C"
    return va

In [22]:
#create column one to many
correlation["PortofEmb2"] = correlation.apply(g, axis=1)

In [23]:
correlation= correlation.drop(["PortofEmb"],axis =1) #and delete the string column
print(correlation) #now here we only have numerical variables

      Survived     Sex   Age  Siblings - Spouse  Parents - Children  \
0          0.0    male  22.0                  1                   0
1          1.0  female  38.0                  1                   0
2          1.0  female  26.0                  0                   0
3          1.0  female  35.0                  1                   0
4          0.0    male  35.0                  0                   0
...        ...     ...   ...                ...                 ...
1304       NaN    male   NaN                  0                   0
1305       NaN  female  39.0                  0                   0
1306       NaN    male  38.5                  0                   0
1307       NaN    male   NaN                  0                   0
1308       NaN    male   NaN                  1                   1

      Ticket class  PortofEmb2
0                3           1
1                1           0
2                3           1
3                1           1
4                3           1
...            ...         ...
1304             3           1
1305             1           0
1306             3           1
1307             3           1
1308             3           0

[1309 rows x 7 columns]

In [24]:
correlation.corr() #here we have the correlation matrix.

,Survived,Age,Siblings - Spouse,Parents - Children,Ticket class,PortofEmb2
Survived,1.000000,-0.077221,-0.035322,0.081629,-0.338481,-0.111203
Age,-0.077221,1.000000,-0.243699,-0.150917,-0.408106,-0.052180
Siblings - Spouse,-0.035322,-0.243699,1.000000,0.373587,0.060832,0.074554
Parents - Children,0.081629,-0.150917,0.373587,1.000000,0.018322,0.096528
Ticket class,-0.338481,-0.408106,0.060832,0.018322,1.000000,-0.035246
PortofEmb2,-0.111203,-0.052180,0.074554,0.096528,-0.035246,1.000000